In [22]:
import pandas as pd
import numpy as np

### CSV Files

In [2]:
df = pd.read_csv("stock_data.csv")

In [3]:
df

,Datasource: Google finance,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4
0,tickers,eps,revenue,price,people
1,GOOGL,27.82,87,845,larry page
2,WMT,4.61,484,65,n.a.
3,MSFT,-1,85,64,bill gates
4,RIL,not available,50,1023,mukesh ambani
5,TATA,5.6,-1,n.a.,ratan tata

In [4]:
df = pd.read_csv("stock_data.csv", skiprows = 1)

In [5]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [6]:
df = pd.read_csv("stock_data.csv", header = 1)

In [7]:
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

<b>to give custom column namesusing: <i><u>names<i><u></b>

In [8]:
df = pd.read_csv("stock_data.csv", header = 1, names = ["stock_symbol", "eps", "revenue","priice","people"])

In [9]:
df

  stock_symbol            eps  revenue priice         people
0        GOOGL          27.82       87    845     larry page
1          WMT           4.61      484     65           n.a.
2         MSFT             -1       85     64     bill gates
3         RIL   not available       50   1023  mukesh ambani
4         TATA            5.6       -1   n.a.     ratan tata

<b>we can specify how many rows we wanna read: <i><u>nrows<u><i></b>

In [10]:
df = pd.read_csv("stock_data.csv", header = 1, nrows = 2)

In [11]:
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

In [12]:
df.index

RangeIndex(start=0, stop=2, step=1)

<b>convert not available values to proper NA values using: <i> na_values<i><b>

In [38]:
df = pd.read_csv("stock_data.csv", header = 1, na_values = {
    'eps' : ['not available'],
    'revenue' : [-1],
    'price' : ['n.a.']
})

In [39]:
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0           n.a.
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

<b>write back to csv: <i>to_csv<i></b>

In [40]:
df["pe"] = df["price"]/df["eps"]

In [41]:
df

  tickers    eps  revenue   price         people         pe
0   GOOGL  27.82     87.0   845.0     larry page  30.373832
1     WMT   4.61    484.0    65.0           n.a.  14.099783
2    MSFT  -1.00     85.0    64.0     bill gates -64.000000
3    RIL     NaN     50.0  1023.0  mukesh ambani        NaN
4    TATA   5.60      NaN     NaN     ratan tata        NaN

In [46]:
df.to_csv("pe.csv")

<i>Note: we will get the index also in that pe.csv file</i><br>
<b>To exclude index: </b>

In [45]:
df.to_csv("pe2.csv", index = False)

<i>dont want header</i>

In [47]:
df.to_csv("pe3.csv", index = False, header = False)

### Excel Files

In [ ]:
df_movies = pd.read_excel("movies_db.xlsx", "movies")
df_movies.head(4)

In [ ]:
df_financials = pd.read_excel("movies_db.xlsx", "financials")
df_financials.head(4)

<b><i><u>Converters<i><u></b>

In [49]:
def standardize_currency(curr):
    if currency == '$$' or currency == 'Dollars':
        return USD
    return curr

In [ ]:
df_financials = pd.read_excel("movies_db.xlsx", "financials", converters = {
    'currency' : standardize_currency
})
df_financials.head(4)

<b><i><u>pd.merge()<i><u></b>

In [ ]:
df_merged = pd.merge("df_movies","df_financials", on = "movie_id")
df_merged.head(4)

In [ ]:
df_merged.to_excel("movies_merged.xlsx", sheet_name = "merged", index = False)

<b><i><u>export two dataframes into a single file<i><u></b>

In [53]:
df_stocks = pd.DataFrame({
    'tickers' : ['GOOGL','WMT','MSFT'],
    'price' : [845,65,64],
    'pe' : [30.37,14.26,30.97],
    'eps' : [27.82,4.61,2.12]
})

df_stocks

  tickers  price     pe    eps
0   GOOGL    845  30.37  27.82
1     WMT     65  14.26   4.61
2    MSFT     64  30.97   2.12

In [54]:
df_weather = pd.DataFrame({
    'day' : ['1/1/2017','1/2/2017','1/3/2017'],
    'temperature' : [32,35,28],
    'event' : ['Rain','Sunny','Snow']
})

In [55]:
df_weather

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [56]:
print(df_weather)

        day  temperature  event
0  1/1/2017           32   Rain
1  1/2/2017           35  Sunny
2  1/3/2017           28   Snow

In [57]:
df_weather.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
with pd.ExcelWriter("stocks_weather.xlsx") as writer:
    df_stocks.to_excel(writer, sheet_name = "stocks")
    df_weather.to_excel(writer, sheet_name = "weather")

ModuleNotFoundError: No module named 'openpyxl'

In [35]:
ankita = pd.Series(['Ankita','Roy',31,'Bangalore', np.NaN], index = [1, 2, 3, 4, 5], name = 'my_details')

In [36]:
ankita

1       Ankita
2          Roy
3           31
4    Bangalore
5          NaN
Name: my_details, dtype: object

In [37]:
ankita.count()

4